emacs_movement.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-29 Sun 17:01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs - Movement</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs - Movement</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0979238">Character-wise movement</a></li>
<li><a href="#org0d48249">Word-wise movement</a></li>
<li><a href="#org7295c8a">Line-wise movement</a></li>
<li><a href="#org671a66e">Sexp-wise movement</a></li>
<li><a href="#org2d14ab8">List-wise movement</a></li>
<li><a href="#org806c3c1">Sentence-wise movement</a></li>
<li><a href="#orgd53c323">Paragraph-wise movement</a></li>
<li><a href="#org0099161">Defun-wise movement</a></li>
<li><a href="#org526c430">Page-wise movement</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0979238" class="outline-2">
<h2 id="org0979238">Character-wise movement</h2>
<div class="outline-text-2" id="text-org0979238">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-f</code></td>
<td class="org-left">Move forward by a character</td>
</tr>

<tr>
<td class="org-left"><code>C-b</code></td>
<td class="org-left">Move backward by a character</td>
</tr>

<tr>
<td class="org-left"><code>C-p</code></td>
<td class="org-left">Move to previous line</td>
</tr>

<tr>
<td class="org-left"><code>C-n</code></td>
<td class="org-left">Move to next line</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0d48249" class="outline-2">
<h2 id="org0d48249">Word-wise movement</h2>
<div class="outline-text-2" id="text-org0d48249">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-f</code></td>
<td class="org-left">Move forward by a word</td>
</tr>

<tr>
<td class="org-left"><code>M-b</code></td>
<td class="org-left">Move backward by a word</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org7295c8a" class="outline-2">
<h2 id="org7295c8a">Line-wise movement</h2>
<div class="outline-text-2" id="text-org7295c8a">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-a</code></td>
<td class="org-left">Move point to the beginning of the line</td>
</tr>

<tr>
<td class="org-left"><code>C-e</code></td>
<td class="org-left">Move point to the end of the line</td>
</tr>

<tr>
<td class="org-left"><code>M-m</code></td>
<td class="org-left">Move point to the first non-whitespace character on this line</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org671a66e" class="outline-2">
<h2 id="org671a66e">Sexp-wise movement</h2>
<div class="outline-text-2" id="text-org671a66e">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-M-f</code></td>
<td class="org-left">Move forward by a s-expression (<i>sexp</i>)</td>
</tr>

<tr>
<td class="org-left"><code>C-M-b</code></td>
<td class="org-left">Move backward by a sexp</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2d14ab8" class="outline-2">
<h2 id="org2d14ab8">List-wise movement</h2>
<div class="outline-text-2" id="text-org2d14ab8">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-M-p</code></td>
<td class="org-left">Move backward to the previous list</td>
</tr>

<tr>
<td class="org-left"><code>C-M-n</code></td>
<td class="org-left">Move forward to the next list</td>
</tr>

<tr>
<td class="org-left"><code>C-M-u</code></td>
<td class="org-left">Move up out of a list</td>
</tr>

<tr>
<td class="org-left"><code>C-M-d</code></td>
<td class="org-left">Move down into a list</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org806c3c1" class="outline-2">
<h2 id="org806c3c1">Sentence-wise movement</h2>
<div class="outline-text-2" id="text-org806c3c1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-a</code></td>
<td class="org-left">Move to the beginning of a sentence</td>
</tr>

<tr>
<td class="org-left"><code>M-e</code></td>
<td class="org-left">Move to the end of a sentence</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd53c323" class="outline-2">
<h2 id="orgd53c323">Paragraph-wise movement</h2>
<div class="outline-text-2" id="text-orgd53c323">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-{</code></td>
<td class="org-left">Move to the beginning of a paragraph</td>
</tr>

<tr>
<td class="org-left"><code>M-}</code></td>
<td class="org-left">Move to the end of a paragraph</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0099161" class="outline-2">
<h2 id="org0099161">Defun-wise movement</h2>
<div class="outline-text-2" id="text-org0099161">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-M-a</code></td>
<td class="org-left">Move to the beginning of a defun</td>
</tr>

<tr>
<td class="org-left"><code>C-M-e</code></td>
<td class="org-left">Move to the end of a defun</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org526c430" class="outline-2">
<h2 id="org526c430">Page-wise movement</h2>
<div class="outline-text-2" id="text-org526c430">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key binding</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-x [</code></td>
<td class="org-left">Move backward by a page</td>
</tr>

<tr>
<td class="org-left"><code>C-x ]</code></td>
<td class="org-left">Move forward by a page</td>
</tr>

<tr>
<td class="org-left"><code>C-v</code></td>
<td class="org-left">Scroll down a page</td>
</tr>

<tr>
<td class="org-left"><code>M-v</code></td>
<td class="org-left">Scroll up a page</td>
</tr>

<tr>
<td class="org-left"><code>C-M-v</code></td>
<td class="org-left">Scroll down the other window</td>
</tr>

<tr>
<td class="org-left"><code>C-M-S-v</code></td>
<td class="org-left">Scroll up the other window</td>
</tr>

<tr>
<td class="org-left"><code>M-&lt;</code></td>
<td class="org-left">Move to the beginning of the buffer</td>
</tr>

<tr>
<td class="org-left"><code>M-&gt;</code></td>
<td class="org-left">Move to the end of the buffer</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>